import footer_logo from '../../assets/images/footer_logo.svg';

const Footer = () => {
  return (
    <footer className='footer'>
      <div className='wrapper footer__wrapper'>
        <div className='footer__info'>
          <span className='footer__rules'>
            Использование сайта означает принятие условий{' '}
            <a className='footer__link' href='#'>
              Пользовательского соглашения
            </a>{' '}
            и{' '}
            <a className='footer__link' href='#'>
              Политики конфиденциальности
            </a>
          </span>
          <span className='footer__copyright'>
            &copy; 2020-2021. Международное агенство продвижения экспорта. Все
            права защищены.
          </span>
        </div>
        <div className='footer__socials'>
          <a className='footer__social'>
            <svg
              className='footer__social-image'
              width='15'
              height='15'
              viewBox='0 0 15 15'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M12.4595 0.300293H1.94044C0.868787 0.300293 0 1.16904 0 2.24072V12.7598C0 13.8315 0.868752 14.7002 1.94044 14.7002H7.1284L7.13724 9.55447H5.80037C5.62663 9.55447 5.48562 9.41399 5.48495 9.24025L5.47854 7.58156C5.47787 7.40687 5.61931 7.26491 5.79399 7.26491H7.12844V5.6622C7.12844 3.80226 8.26438 2.78951 9.92358 2.78951H11.2851C11.4593 2.78951 11.6005 2.93073 11.6005 3.10496V4.50357C11.6005 4.67773 11.4594 4.81892 11.2853 4.81902L10.4497 4.81941C9.54739 4.81941 9.37267 5.24818 9.37267 5.87743V7.26495H11.3554C11.5443 7.26495 11.6909 7.42991 11.6686 7.61753L11.472 9.27622C11.4532 9.43495 11.3186 9.55454 11.1588 9.55454H9.38151L9.37267 14.7003H12.4596C13.5312 14.7003 14.4 13.8315 14.4 12.7599V2.24072C14.4 1.16904 13.5312 0.300293 12.4595 0.300293Z'
                fill='#475993'
              />
            </svg>
          </a>
          <a className='footer__social'>
            <svg
              className='footer__social-image'
              width='18'
              height='13'
              viewBox='0 0 18 13'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M17.2186 2.15384C17.0164 1.37688 16.4205 0.765063 15.6638 0.55742C14.2924 0.180054 8.79307 0.180054 8.79307 0.180054C8.79307 0.180054 3.2937 0.180054 1.92229 0.55742C1.16558 0.765063 0.569651 1.37688 0.367411 2.15384C0 3.56198 0 6.50007 0 6.50007C0 6.50007 0 9.43807 0.367411 10.8463C0.569651 11.6233 1.16558 12.2351 1.92229 12.4428C3.2937 12.8201 8.79307 12.8201 8.79307 12.8201C8.79307 12.8201 14.2924 12.8201 15.6638 12.4428C16.4205 12.2351 17.0164 11.6233 17.2186 10.8463C17.5861 9.43807 17.5861 6.50007 17.5861 6.50007C17.5861 6.50007 17.5861 3.56198 17.2186 2.15384Z'
                fill='#FF0000'
              />
              <path
                d='M7.14435 9.52265V4.02698L11.5409 6.77492L7.14435 9.52265Z'
                fill='white'
              />
            </svg>
          </a>
        </div>
        <div className='footer__logo-container'>
          <img className='footer__logo' src={footer_logo} alt='logo' />
        </div>
      </div>
    </footer>
  );
};
export { Footer };
